Ok, i have tested with "vanilla" module version 6.0.1 and with key_name explicitly defined:

TF plan 
```
 # module.eks.aws_launch_template.workers_launch_template[0] will be created
  + resource "aws_launch_template" "workers_launch_template" {
      + arn             = (known after apply)
      + default_version = (known after apply)
      + ebs_optimized   = (known after apply)
      + id              = (known after apply)
      + image_id        = (known after apply)
      + instance_type   = (known after apply)
      + key_name        = "ansible"
      + latest_version  = (known after apply)
      + name            = (known after apply)
      + name_prefix     = (known after apply)
      + tags            = {
          + "Environment" = "test"
          + "Workspace"   = "default"
        }
      + user_data       = (known after apply)

      + block_device_mappings {
          + device_name = (known after apply)

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = (known after apply)
              + iops                  = (known after apply)
              + kms_key_id            = (known after apply)
              + volume_size           = (known after apply)
              + volume_type           = (known after apply)
            }
        }

      + credit_specification {
          + cpu_credits = (known after apply)
        }

      + iam_instance_profile {
          + name = (known after apply)
        }

      + instance_market_options {
          + market_type = (known after apply)
        }

      + monitoring {
          + enabled = (known after apply)
        }

      + network_interfaces {
          + associate_public_ip_address = (known after apply)
          + delete_on_termination       = (known after apply)
          + security_groups             = (known after apply)
        }

      + placement {
          + group_name = (known after apply)
          + tenancy    = (known after apply)
        }

      + tag_specifications {
          + resource_type = "volume"
          + tags          = (known after apply)
        }
    }
```
where `key_name        = "ansible"`

and got the same error 

```
Error: Provider produced inconsistent final plan

When expanding the plan for
module.eks.aws_autoscaling_group.workers_launch_template[0] to include new
values learned so far during apply, provider "aws" produced an invalid new
value for .initial_lifecycle_hook: planned set element
cty.ObjectVal(map[string]cty.Value{"default_result":cty.UnknownVal(cty.String),
"heartbeat_timeout":cty.UnknownVal(cty.Number),
"lifecycle_transition":cty.UnknownVal(cty.String),
"name":cty.UnknownVal(cty.String),
"notification_metadata":cty.UnknownVal(cty.String),
"notification_target_arn":cty.UnknownVal(cty.String),
"role_arn":cty.UnknownVal(cty.String)}) does not correlate with any element in
actual.
```

second run - i defined key inside module, just in case

```
  # key_name = lookup(
  #   var.worker_groups_launch_template[count.index],
  #   "key_name",
  #   local.workers_group_defaults["key_name"],
  # )

  key_name = "ansible"
```

Result the same. 

Now, i guess this means that issue not with local key at all. 